================================================================================
Top-level inline test
================================================================================

test "basic addition" = 1 + 1 == 2

--------------------------------------------------------------------------------

(source_file
  (inline_test
    (string_literal)
    (binary_expression
      (binary_expression
        (literal
          (integer_literal))
        (literal
          (integer_literal)))
      (literal
        (integer_literal)))))

================================================================================
Multiple top-level inline tests
================================================================================

test "integers" = 42 == 42
test "floats" = 3.14 == 3.14
test "booleans" = true == true

--------------------------------------------------------------------------------

(source_file
  (inline_test
    (string_literal)
    (binary_expression
      (literal
        (integer_literal))
      (literal
        (integer_literal))))
  (inline_test
    (string_literal)
    (binary_expression
      (literal
        (float_literal))
      (literal
        (float_literal))))
  (inline_test
    (string_literal)
    (binary_expression
      (literal
        (boolean_literal))
      (literal
        (boolean_literal)))))

================================================================================
Inline test with string comparison
================================================================================

test "strings" = "hello" == "hello"

--------------------------------------------------------------------------------

(source_file
  (inline_test
    (string_literal)
    (binary_expression
      (literal
        (string_literal))
      (literal
        (string_literal)))))

================================================================================
Inline test with function call
================================================================================

test "add works" = add(1, 2) == 3

--------------------------------------------------------------------------------

(source_file
  (inline_test
    (string_literal)
    (binary_expression
      (call_expression
        (identifier)
        (literal
          (integer_literal))
        (literal
          (integer_literal)))
      (literal
        (integer_literal)))))

================================================================================
Function with where block containing tests
================================================================================

add : Int -> Int
add = |a| a + 1
where
  test "basic" = add(1) == 2

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (literal
          (integer_literal))))
    (where_block
      (inline_test
        (string_literal)
        (binary_expression
          (call_expression
            (identifier)
            (literal
              (integer_literal)))
          (literal
            (integer_literal)))))))

================================================================================
Where block with multiple tests
================================================================================

add : Int -> Int
add = |a| a + 1
where
  test "basic" = add(1) == 2
  test "zero" = add(0) == 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (literal
          (integer_literal))))
    (where_block
      (inline_test
        (string_literal)
        (binary_expression
          (call_expression
            (identifier)
            (literal
              (integer_literal)))
          (literal
            (integer_literal))))
      (inline_test
        (string_literal)
        (binary_expression
          (call_expression
            (identifier)
            (literal
              (integer_literal)))
          (literal
            (integer_literal)))))))
