================================================================================
Binary expression - addition
================================================================================

bin_add : Int -> Int
bin_add = |a| a + 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (literal
          (integer_literal))))))

================================================================================
Binary expression - comparison
================================================================================

eq : Int -> Boolean
eq = |a| a == 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (literal
          (integer_literal))))))

================================================================================
Binary expression - logical and
================================================================================

both : Int -> Int
both = |n| n && m

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (identifier)))))

================================================================================
Binary expression - logical or
================================================================================

either : Int -> Int
either = |n| n || m

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (identifier)))))

================================================================================
Unary expression - negation
================================================================================

neg : Int -> Int
neg = |x| -x

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (unary_expression
        (identifier)))))

================================================================================
Unary expression - logical not
================================================================================

inv : Int -> Int
inv = |n| !n

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (unary_expression
        (identifier)))))

================================================================================
Pipe expression
================================================================================

piped : Int -> Int
piped = |x| x |> f |> g

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (pipe_expression
        (pipe_expression
          (identifier)
          (identifier))
        (identifier)))))

================================================================================
Field access
================================================================================

get_name : String -> String
get_name = |user| user.name

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (field_expression
        (identifier)
        (identifier)))))

================================================================================
Nested field access
================================================================================

deep : Int -> Int
deep = |n| response.body.data

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (field_expression
        (field_expression
          (identifier)
          (identifier))
        (identifier)))))

================================================================================
Call expression
================================================================================

app : Int -> Int
app = |x| f(x)

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (call_expression
        (identifier)
        (identifier)))))

================================================================================
Call expression with multiple arguments
================================================================================

app : Int -> Int
app = |n| add(1, 2)

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (call_expression
        (identifier)
        (literal
          (integer_literal))
        (literal
          (integer_literal))))))

================================================================================
If expression
================================================================================

choose : Int -> Int
choose = |a| if a > 0 then a else 0

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (if_expression
        (binary_expression
          (identifier)
          (literal
            (integer_literal)))
        (identifier)
        (literal
          (integer_literal))))))

================================================================================
Chained if expression
================================================================================

chained : Int -> Int
chained = |a| if a > 0 then 1 else if a < 0 then 2 else 0

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (if_expression
        (binary_expression
          (identifier)
          (literal
            (integer_literal)))
        (literal
          (integer_literal))
        (if_expression
          (binary_expression
            (identifier)
            (literal
              (integer_literal)))
          (literal
            (integer_literal))
          (literal
            (integer_literal)))))))

================================================================================
Match expression with constructor patterns
================================================================================

unwrap : Int -> Int
unwrap = |x| match x
  Some(v) -> v
  None -> 0

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (match_expression
        (identifier)
        (match_arm
          (constructor_pattern
            (type_identifier)
            (identifier))
          (identifier))
        (match_arm
          (type_identifier)
          (literal
            (integer_literal)))))))

================================================================================
Match expression with literal patterns
================================================================================

describe : Int -> String
describe = |n| match n
  1 -> "one"
  2 -> "two"
  _ -> "other"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (match_expression
        (identifier)
        (match_arm
          (literal
            (integer_literal))
          (literal
            (string_literal)))
        (match_arm
          (literal
            (integer_literal))
          (literal
            (string_literal)))
        (match_arm
          (wildcard_pattern)
          (literal
            (string_literal)))))))

================================================================================
Match expression with tuple pattern
================================================================================

sum_pair : Int -> Int
sum_pair = |n| match n
  (a, b) -> a + b
  _ -> 0

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (match_expression
        (identifier)
        (match_arm
          (tuple_pattern
            (identifier)
            (identifier))
          (binary_expression
            (identifier)
            (identifier)))
        (match_arm
          (wildcard_pattern)
          (literal
            (integer_literal)))))))

================================================================================
List expression
================================================================================

nums : Int -> List<Int>
nums = |n| [1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (generic_type
        (type_identifier)
        (type_identifier)))
    name: (identifier)
    body: (lambda
      (identifier)
      (list_expression
        (literal
          (integer_literal))
        (literal
          (integer_literal))
        (literal
          (integer_literal))))))

================================================================================
Empty list expression
================================================================================

empty : Int -> Int
empty = |n| []

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (list_expression))))

================================================================================
Record expression
================================================================================

rec : Int -> Int
rec = |n| { name: "Alice", age: 30 }

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (record_expression
        (record_field_init
          (identifier)
          (literal
            (string_literal)))
        (record_field_init
          (identifier)
          (literal
            (integer_literal)))))))

================================================================================
Struct expression
================================================================================

make_user : String -> String
make_user = |n| User { name: n }

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (struct_expression
        (type_identifier)
        (record_field_init
          (identifier)
          (identifier))))))

================================================================================
Tuple expression
================================================================================

mk : Int -> Int
mk = |n| (1, 2, 3)

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (tuple_expression
        (literal
          (integer_literal))
        (literal
          (integer_literal))
        (literal
          (integer_literal))))))

================================================================================
Block expression
================================================================================

compute : Int -> Int
compute = |n| {
  let x = 10;
  let y = 20;
  x + y
}

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (block
        (let_binding
          (identifier)
          (literal
            (integer_literal)))
        (let_binding
          (identifier)
          (literal
            (integer_literal)))
        (binary_expression
          (identifier)
          (identifier))))))

================================================================================
Let binding with type annotation
================================================================================

typed : Int -> Int
typed = |n| {
  let x : Int = 10;
  x
}

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (block
        (let_binding
          (identifier)
          type: (type_annotation
            (type_identifier))
          (literal
            (integer_literal)))
        (identifier)))))

================================================================================
Range expression
================================================================================

rng : Int -> Int
rng = |n| 1..10

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (range_expression
        (literal
          (integer_literal))
        (literal
          (integer_literal))))))

================================================================================
For expression
================================================================================

each : Int -> Int
each = |n| for x in [1, 2, 3] do x + 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (for_expression
        (identifier)
        (list_expression
          (literal
            (integer_literal))
          (literal
            (integer_literal))
          (literal
            (integer_literal)))
        (binary_expression
          (identifier)
          (literal
            (integer_literal)))))))

================================================================================
Unit expression
================================================================================

unit : Int -> Int
unit = |x| ()

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (tuple_expression))))
