================================================================================
Simple function definition
================================================================================

add : Int -> Int
add = |a| a + 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (binary_expression
        (identifier)
        (literal
          (integer_literal))))))

================================================================================
Function with tuple type signature
================================================================================

add : (Int, Int) -> Int
add = |a, b| a + b

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (tuple_type
        (type_identifier)
        (type_identifier))
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (identifier)
      (binary_expression
        (identifier)
        (identifier)))))

================================================================================
Function with string interpolation
================================================================================

greet : String -> String
greet = |name| "Hello, ${name}"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal
          (interpolation
            (identifier)))))))

================================================================================
Effectful function
================================================================================

fetch! : String -> {Http} String
fetch! = |url| Http.get!(url)

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (effect_identifier)
    signature: (type_signature
      (type_identifier)
      (effect_set
        (type_identifier))
      (type_identifier))
    name: (effect_identifier)
    body: (lambda
      (identifier)
      (call_expression
        (field_expression
          (type_identifier)
          (effect_identifier))
        (identifier)))))

================================================================================
Function with block body
================================================================================

process : String -> String
process = |input| {
  let validated = validate(input);
  transform(validated)
}

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (block
        (let_binding
          (identifier)
          (call_expression
            (identifier)
            (identifier)))
        (call_expression
          (identifier)
          (identifier))))))

================================================================================
Export function
================================================================================

export greet : String -> String
greet = |name| "Hello"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal)))))

================================================================================
Function with @test section
================================================================================

fn add(a: Int) -> Int = a + 1

@test
test "basic" = add(1) == 2
test "zero" = add(0) == 1

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    params: (param_list
      (param
        pattern: (identifier)
        type: (type_identifier)))
    return_type: (type_identifier)
    body: (binary_expression
      (identifier)
      (literal
        (integer_literal))))
  (test_section
    (inline_test
      (string_literal
        (string_start)
        (string_content)
        (string_end))
      (binary_expression
        (call_expression
          (identifier)
          (literal
            (integer_literal)))
        (literal
          (integer_literal))))
    (inline_test
      (string_literal
        (string_start)
        (string_content)
        (string_end))
      (binary_expression
        (call_expression
          (identifier)
          (literal
            (integer_literal)))
        (literal
          (integer_literal))))))
