================================================================================
Integer literal
================================================================================

id : Int -> Int
id = |x| 42

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (integer_literal)))))

================================================================================
Negative integer (unary expression)
================================================================================

id : Int -> Int
id = |x| -17

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (unary_expression
        (literal
          (integer_literal))))))

================================================================================
Float literal
================================================================================

id : Int -> Int
id = |x| 3.14

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (float_literal)))))

================================================================================
Scientific notation float
================================================================================

id : Int -> Int
id = |x| 1.5e10

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (float_literal)))))

================================================================================
Boolean literal true
================================================================================

id : Int -> Boolean
id = |x| true

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (boolean_literal)))))

================================================================================
Boolean literal false
================================================================================

id : Int -> Boolean
id = |x| false

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (boolean_literal)))))

================================================================================
Simple string literal
================================================================================

id : Int -> String
id = |x| "Hello, World"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal)))))

================================================================================
String with escape sequences
================================================================================

id : Int -> String
id = |x| "Line 1\nLine 2"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal
          (escape_sequence))))))

================================================================================
String with escaped quotes
================================================================================

id : Int -> String
id = |x| "Say \"hello\""

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal
          (escape_sequence)
          (escape_sequence))))))

================================================================================
String interpolation
================================================================================

id : Int -> String
id = |x| "Hello, ${name}"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal
          (interpolation
            (identifier)))))))

================================================================================
Complex string interpolation
================================================================================

id : Int -> String
id = |x| "${a} + ${b} = ${a + b}"

--------------------------------------------------------------------------------

(source_file
  (function_def
    name: (identifier)
    signature: (type_signature
      (type_identifier)
      (type_identifier))
    name: (identifier)
    body: (lambda
      (identifier)
      (literal
        (string_literal
          (interpolation
            (identifier))
          (interpolation
            (identifier))
          (interpolation
            (binary_expression
              (identifier)
              (identifier))))))))
